# coding: utf8
"""
Complete collection of stopwords for the Urdu language.
Maintainer: Ikram Ali(mrikram1989@gmail.com)
version = 2019.09.15
Source = https://github.com/urduhack/urdu-stopwords
"""

# Urdu Language Stop words list
STOP_WORDS = frozenset("""

آ آئی آئیں آئے آتا آتی آتے آداب آدھ آدھا آدھوں آدھی آدھیوں آدھے
 آس آفرین آمدید آنا آنسہ آنی آنے آٹھ آٹھواں آٹھویں آپ آگے آہ آہا
 آیا اب ابھی ابے اتوار اجی اخاہ ارب اربواں اربویں اری ارے از اس
 اسوج اسکا اسکی اسکے اسی اسیواں اسیویں اسے اف افوہ الا الاول البتہ الثانی
 الحرام السلام الف اللہ المبارک المرجب المظفر المعظم المکرم ان اناسی اناسیواں اناسیویں انتالیس
 انتالیسواں انتالیسویں انتیس انتیسواں انتیسویں اندر انسٹھ انسٹھواں انسٹھویں انچاس انچاسواں انچاسویں انکا انکی
 انکے انہتر انہترواں انہترویں انہوں انہی انہیں انیس انیسواں انیسوویں او اوئے اور اوپر
 اوہو اٹھائیس اٹھائیسواں اٹھائیسویں اٹھارہ اٹھاسی اٹھاسیواں اٹھاسیویں اٹھانوے اٹھانوےواں اٹھانوےویں اٹھاون اٹھاونواں
 اٹھاونویں اٹہتر اٹہترواں اٹہترویں اپ اپریل اپنا اپنوں اپنی اپنے اپنےآپ اڑتالیس اڑتالیسواں اڑتالیسویں
 اڑتیس اڑتیسواں اڑتیسویں اڑسٹھ اڑسٹھواں اڑسٹھویں اڑھائی اکاسی اکاسیواں اکاسیویں اکانوے اکانوےواں اکانوےویں اکاون
 اکاونواں اکاونویں اکبر اکتالیس اکتالیسواں اکتالیسویں اکتوبر اکتیس اکتیسواں اکتیسویں اکثر اکسٹھ اکسٹھواں اکسٹھویں
 اکہتر اکہترواں اکہترویں اکیاسی اکیاسیواں اکیاسیویں اکیانواےواں اکیانوے اکیاونویں اکیس اکیسواں
 اکیسویں اگر اگرچہ اگست اہاہا ایسا ایسی ایسے ایک اے با بائیس بائیسواں بائیسویں
 بائیں باد بار بارک بارہ بارہواں بارہویں بارے باسٹھ باسٹھواں باسٹھویں بالکل بانوے بانوےواں
 بانوےویں باوجود باون باونواں باونویں باہر بتیس بتیسواں بتیسویں بج بجز بجے بخیر بدور بدھ
 برسات بزات بشرطیکہ بعض بعضے بغیر بلکہ بلین بن بنا بناؤ بند بڑی بھادوں
 بھر بھریں بھی بہار بہت بہتر بہترواں بہترویں بیاسی بیاسیواں بیاسیویں بیالیس بیالیسواں بیالیسویں
 بیس بیساکھ بیسواں بیسویں بیچ بیگم بے بےشک تا تاکہ تاہم تب تجھ تجھی
 تجھے تحت تر ترا تراسی تراسیواں تراسیویں ترانوے ترانوےواں ترانوےویں تری تریسٹھ تریسٹھواں تریسٹھویں
 تریپن تریپنواں تریپنویں ترے تسلیمات تلک تم تمام تمہارا تمہاروں تمہاری تمہارے تمہیں تو
 تک تگنا تگنوں تگنی تگنیوں تگنے تھا تھو تھی تھیں تھے تہائی تہتر تہترواں
 تہترویں تیئیس تیئیسواں تیئیسویں تیرا تیروں تیرہ تیرہواں تیرہویں تیری تیرے تیس تیسرا تیسری تیسرے
 تیسواں تیسویں تین تینتالیس تینتالیسواں تینتالیسویں تینتیس تینتیسواں تینتیسویں جا جاؤ جائیں جائے جاتا
 جاتی جاتے جانی جانے جب جبکہ جدھر جز جزاک جس جسے جمادی جمعرات جمعہ
 جن جناب جنوب جنوری جنہوں جنہیں جو جولائی جون جہاں جی جیسا جیسوں جیسی
 جیسے جیٹھ حافظ حالانکہ حالاں حصہ حضرت خاطر خالی خدا خزاں خواہ خوب خود
 خوش دائیں درمیان دریں دس دسمبر دسواں دسویں دو دوران دوسرا دوسروں دوسری دوسرے
 دوشنبہ دوپہر دوں دکھائیں دگنا دگنوں دگنی دگنیوں دگنے دی دیئے دیا دیتا دیتی
 دیتے دیر دینا دینی دینے دیکھو دیں دیے دے ذریعے ذوالحجہ رات ربیع رجب رکھا
 رکھتا رکھتی رکھتے رکھنا رکھنی رکھنے رکھو رکھی رکھے رہ رہا رہتا رہتی رہتے
 رہنا رہنی رہنے رہو رہی رہیں رہے ری رے زندہ سا سات ساتواں ساتویں
 ساتھ سامنے ساون ساٹھ ساٹھواں ساٹھویں ساڑھے سب سبحان سبھی ستائیس ستائیسواں ستائیسویں ستاسی
 ستاسیواں ستاسیویں ستانوے ستانوےواں ستانوےویں ستاون ستاونواں ستاونویں ستتر ستترواں ستترویں ستر سترہ سترہواں
 سترہویں ستمبر سراسر سردی سرما سلام سلامت سمیت سنتیس سنکھ سنکھواں سنکھویں سو سوا
 سوائے سولہ سولہواں سولہویں سوموار سوواں سوویں سڑسٹھ سڑسٹھواں سڑسٹھویں سکا سکتا سکتے سہ
 سہی سی سینتالیس سینتالیسواں سینتالیسویں سینتیسواں سینتیسویں سینکڑا سیکنڈ سیکنڈوں سیکڑا سے شاباش شام
 شاید شب شبنہ شعبان شمال شنبہ شوال شکریہ صاحب صاحبہ صبح صرف صفر ضرور طرح
 طرف طور علاوہ علیکم عین فروری فقط فلاں فی قبل قطا لئے لا لائی
 لائے لاتا لاتی لاتے لانا لانی لانے لاکھ لاکھواں لاکھویں لایا لو لوجی لوگ
 لوگوں لگ لگا لگتا لگتی لگی لگیں لگے لہذا لہزا لی لیا لیتا لیتی
 لیتے لیکن لیں لیے لے مئی مارچ ماسوا ماشااللہ مانند ماگھ مبارک مت مثل
 مجھ مجھی مجھے محترم محترمہ محترمی محرم محض مرا مرحبا مری مرے مزاج مزید
 مس مسز مسٹر مشرق مطابق مطلق مغرب مل منٹ منٹوں منگل مکرمی مگر مگھر
 مہربانی میرا میروں میری میرے میں نا نزدیک نصف نما ننانوے نناوےواں نناوےویں نو نواسی
 نواسیواں نواسیویں نواں نومبر نویں نوے نہ نہیں نیز نیچے نے و وار واسطے
 واقعی والا والوں والی والے واں واہ وجہ ورنہ وعلیکم وغیرہ ولے وگرنہ وہ
 وہاں وہی وہیں وی ویسا ویسے ویں ٹریلین پاس پانچ پانچواں پانچویں پایا پدمواں
 پدمویں پر پس پلیز پنج پندرہ پندرہواں پندرہویں پون پونا پونوں پونی پونیوں پونے
 پچاس پچاسواں پچاسویں پچاسی پچاسیواں پچاسیویں پچانوے پچانوےواں پچانوےویں پچپن پچپنواں پچپنویں پچھتر پچھترواں
 پچھترویں پچیس پچیسواں پچیسویں پھاگن پھر پہ پہر پہلا پہلی پہلے پیر پینتالیس پینتالیسواں
 پینتالیسویں پینتیس پینتیسواں پینتیسویں پینسٹھواں پینسٹھویں پیچھے چار چالیس چالیسواں چالیسویں چاہئے چاہتے چاہیئے
 چاہے چشم چلا چلو چلیں چلے چناچہ چند چوالیس چوالیسواں چوالیسویں چوبیس چوبیسواں چوبیسویں
 چوتھا چوتھائی چوتھی چوتھے چودہ چودہواں چودہویں چوراسی چوراسیواں چوراسیویں چورانوے چورانوےواں چورانوےویں چون
 چونتیس چونتیسواں چونتیسویں چونسٹھ چونسٹھواں چونسٹھویں چونواں چونویں چونکہ چوگنا چوگنوں چوگنی چوگنیوں چوگنے
 چوہتر چوہترواں چوہترویں چکی چکیں چکے چھ چھبیس چھبیسواں چھبیسویں چھتیس چھتیسواں چھتیسویں چھٹا
 چھٹی چھٹے چھپن چھپنواں چھپنویں چھہتر چھہترواں چھہترویں چھی چھیاسٹھ چھیاسٹھواں چھیاسٹھویں چھیاسی چھیاسیواں
 چھیاسیویں چھیالیس چھیالیسواں چھیالیسویں چھیانوے چھیانوےواں چھیانوےویں چہارشنبہ چیت ڈالنی ڈالنے ڈالے ڈھائی ڈیڑھ
 کئے کا کاتک کاش کب کبھی کدھر کر کرتا کرتی کرتے کرم کرنا کرنے کرو
 کروڑ کروڑواں کروڑویں کریں کرے کس کسی کسے کل کم کن کنہیں کو کوئی
 کون کونسا کونسے کچھ کھرب کھربواں کھربویں کہ کہا کہاں کہہ کہی کہیں کہے
 کی کیا کیسا کیسے کیونکر کیونکہ کیوں کیے کے گئی گئے گا گرما گرمی
 گنا گو گویا گھنٹا گھنٹوں گھنٹے گی گیا گیارہ گیارہواں گیارہویں گے ہائیں ہائے
 ہاڑ ہاں ہر ہرچند ہرگز ہزار ہزارواں ہزارویں ہفتہ ہم ہمارا ہماروں ہماری ہمارے
 ہمی ہمیں ہو ہوئی ہوئیں ہوئے ہوا ہوبہو ہوتا ہوتی ہوتیں ہوتے ہونا ہونگے
 ہونی ہونے ہوں ہی ہیلو ہیں ہے یا یات یعنی یک یہ یہاں یہی یہیں


""".split())
