# coding: utf8
"""
Collection of stopwords for the Urdu language.
"""

from __future__ import unicode_literals

# Urdu Language Stop words list
STOP_WORDS = set("""

 ! !! !? " # $ % & ' '' ( ) * + , -
 . .. ... : ; < > ? ?! ?? @ [ ] ^ ` ``
 { } آ آئی آئیں آئے آتا آتی آتے آنا آنی آنے آگے آیا اس اسی
 اسے ان انہوں انہی انہیں او اور اپنا اپنی اپنے اگر ایسا ایسی ایسے اے با
 بعد بعض بلکہ بھی بہت بے تا تاکہ تب تجھ تجھے تم تمام تمہارا تمہاری تمہارے
 تمہیں تو تک تھا تھی تھیں تھے تیری جا جاؤ جائیں جائے جاتا جاتی جاتے جانی
 جانے جب جس جن جنہوں جنہیں جو جیسا جیسوں جیسی جیسے حالانکہ حالاں دو دوں دی
 دیئے دیا دیتا دیتی دیتے دینا دینی دینے دیں دیے دے رکھا رکھتا رکھتی رکھتے رکھنا
 رکھنی رکھنے رکھی رکھے رہ رہا رہتا رہتی رہتے رہنا رہنی رہنے رہو رہی رہیں رہے سا
 سب سو سی سے صرف طرح طرف عین لئے لا لائی لائے لاتا لاتی لاتے لانا
 لانی لانے لایا لو لگا لگی لگیں لگے لی لیا لیتا لیتی لیتے لیکن لیں لیے
 لے مجھ مجھے مگر میرا میری میرے میں نا نہ نہیں نے و والا والوں والی
 والے وہ وہاں وہی وہیں پر پھر پہلے چاہیئے چاہے چونکہ ڈالا ڈالنا ڈالنی ڈالنے ڈالی
 ڈالے کئے کا کر کرتا کرتی کرتے کرنا کرنے کرو کریں کرے کس کسی کسے کو
 کوئی کون کچھ کہ کہا کہے کی کیا کیسے کیونکہ کیوں کیے کے گئی گئے گا
 گویا گی گیا گے ہاں ہر ہم ہمارا ہماری ہمارے ہو ہوئی ہوئیں ہوئے ہوا ہوتا
 ہوتی ہوتیں ہوتے ہونا ہونگے ہونی ہونے ہوں ہی ہیں ہے یا یعنی یہ یہاں یہی یہیں


""".split())
